In [1]:
import numpy as np 
import pandas as pd

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [5]:
from numpy import nan as NA

In [6]:
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data[data.notnull()]#等价于上面的式子

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()#dropna()在处理DataFrame对象时，默认情况下会清除整行，可以通过how=('all'/'any')控制，axis=1参数控制清除列元素
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [12]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [14]:
data.dropna(how='all', axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -1.352953       NaN       NaN
1  0.099671       NaN       NaN
2 -0.836975       NaN  0.716839
3 -0.364414       NaN -3.546787
4  0.291985 -0.713644 -0.072787
5  1.105390 -1.641063  0.860997
6  0.860786 -0.536725 -0.785605

In [16]:
df.dropna()

          0         1         2
4  0.291985 -0.713644 -0.072787
5  1.105390 -1.641063  0.860997
6  0.860786 -0.536725 -0.785605

In [17]:
df.dropna(thresh=2)#thresh参数，保留数值以内的行或者列

          0         1         2
2 -0.836975       NaN  0.716839
3 -0.364414       NaN -3.546787
4  0.291985 -0.713644 -0.072787
5  1.105390 -1.641063  0.860997
6  0.860786 -0.536725 -0.785605

In [18]:
df.fillna(0)#fillna方法可以用来补充缺失值

          0         1         2
0 -1.352953  0.000000  0.000000
1  0.099671  0.000000  0.000000
2 -0.836975  0.000000  0.716839
3 -0.364414  0.000000 -3.546787
4  0.291985 -0.713644 -0.072787
5  1.105390 -1.641063  0.860997
6  0.860786 -0.536725 -0.785605

In [19]:
df.fillna({1:0.5, 2:0})

          0         1         2
0 -1.352953  0.500000  0.000000
1  0.099671  0.500000  0.000000
2 -0.836975  0.500000  0.716839
3 -0.364414  0.500000 -3.546787
4  0.291985 -0.713644 -0.072787
5  1.105390 -1.641063  0.860997
6  0.860786 -0.536725 -0.785605

In [20]:
df#注意：fillna返回的是一个新的对象

          0         1         2
0 -1.352953       NaN       NaN
1  0.099671       NaN       NaN
2 -0.836975       NaN  0.716839
3 -0.364414       NaN -3.546787
4  0.291985 -0.713644 -0.072787
5  1.105390 -1.641063  0.860997
6  0.860786 -0.536725 -0.785605

In [21]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -1.352953  0.000000  0.000000
1  0.099671  0.000000  0.000000
2 -0.836975  0.000000  0.716839
3 -0.364414  0.000000 -3.546787
4  0.291985 -0.713644 -0.072787
5  1.105390 -1.641063  0.860997
6  0.860786 -0.536725 -0.785605

In [23]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.949799  0.712304 -1.605246
1 -0.164048  0.014426  0.365927
2 -1.097242       NaN -0.679554
3 -0.505003       NaN  0.432603
4  1.541751       NaN       NaN
5 -2.000520       NaN       NaN

In [24]:
df.fillna(method='ffill')#ffill前向填充，bfill后向填充

          0         1         2
0  0.949799  0.712304 -1.605246
1 -0.164048  0.014426  0.365927
2 -1.097242  0.014426 -0.679554
3 -0.505003  0.014426  0.432603
4  1.541751  0.014426  0.432603
5 -2.000520  0.014426  0.432603

In [25]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.949799  0.712304 -1.605246
1 -0.164048  0.014426  0.365927
2 -1.097242  0.014426 -0.679554
3 -0.505003  0.014426  0.432603
4  1.541751       NaN  0.432603
5 -2.000520       NaN  0.432603

In [26]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [27]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [28]:
data.duplicated()#duplicated()方法返回bool的Series,表示的是每一行是否存在重复

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [30]:
data.drop_duplicates()#返回duplicated方法数组中为False的部分

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [31]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])#基于某一列去除重复值

    k1  k2  v1
0  one   1   0
1  two   1   1

In [32]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [39]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [40]:
meat_to_animal =  {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [41]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [42]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [43]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [44]:
data = pd.Series([1., -999, 2., -999., -1000., 3])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [45]:
data.replace(-999, np.nan)#replace方法替换掉指定值，当然了，替换后生成了新的对象，除非传入(inplace=True)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [46]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [47]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [48]:
data.replace({-999: np.nan, -1000: 0})#注意：data.replace方法和data.str.replace方法是不同的，data.str.replace是对字符串进行按元素的替换操作

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [50]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns= ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [51]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [52]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [53]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [54]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekboo'})

         one  two  peekboo  four
INDIANA    0    1        2     3
COLO       4    5        6     7
NEW        8    9       10    11

In [55]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [58]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins  = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)#cut可以实现数据的分组
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [59]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [60]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [61]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [62]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [63]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [64]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)#percision十进制数的精度控制

[(0.75, 0.99], (0.031, 0.27], (0.031, 0.27], (0.51, 0.75], (0.75, 0.99], ..., (0.27, 0.51], (0.031, 0.27], (0.75, 0.99], (0.75, 0.99], (0.27, 0.51]]
Length: 20
Categories (4, interval[float64]): [(0.031, 0.27] < (0.27, 0.51] < (0.51, 0.75] < (0.75, 0.99]]

In [66]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4)
cats

[(-3.717, -0.696], (-0.696, -0.0545], (-3.717, -0.696], (-3.717, -0.696], (-3.717, -0.696], ..., (-0.696, -0.0545], (0.652, 3.344], (0.652, 3.344], (-3.717, -0.696], (-3.717, -0.696]]
Length: 1000
Categories (4, interval[float64]): [(-3.717, -0.696] < (-0.696, -0.0545] < (-0.0545, 0.652] < (0.652, 3.344]]

In [67]:
pd.value_counts(cats)

(0.652, 3.344]       250
(-0.0545, 0.652]     250
(-0.696, -0.0545]    250
(-3.717, -0.696]     250
dtype: int64

In [68]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.278, -0.0545], (-1.278, -0.0545], (-1.278, -0.0545], (-3.717, -1.278], (-1.278, -0.0545], ..., (-1.278, -0.0545], (-0.0545, 1.211], (1.211, 3.344], (-3.717, -1.278], (-3.717, -1.278]]
Length: 1000
Categories (4, interval[float64]): [(-3.717, -1.278] < (-1.278, -0.0545] < (-0.0545, 1.211] < (1.211, 3.344]]

In [70]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.008479     0.080778     0.002377    -0.022586
std       0.977118     1.022162     1.000411     0.964948
min      -3.196668    -3.131047    -2.969285    -2.942798
25%      -0.647930    -0.589216    -0.663148    -0.667419
50%       0.015103     0.066755     0.005569    -0.059944
75%       0.710248     0.782405     0.688046     0.612678
max       3.549399     3.347344     3.465489     3.398408

In [71]:
col = data[2]
col[np.abs(col) > 3]

726    3.465489
Name: 2, dtype: float64

In [72]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
1   -3.196668  0.493399 -2.410682  0.962610
63   3.062717 -1.054645  0.358765 -0.582262
89   0.762178 -3.131047 -1.060292 -0.359344
442 -1.037038  3.347344  0.753287  0.086370
519  3.549399 -0.669868 -0.618912 -0.602228
557 -3.154391 -1.308197 -0.269873  0.337161
581  3.142030  0.776896  1.534885  0.308543
649  0.049569 -3.025849 -0.184370 -0.911335
726 -0.582287 -0.918533  3.465489 -0.677667
797 -0.732739 -0.468007  0.477954  3.398408

In [73]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.008076     0.080588     0.001911    -0.022985
std       0.973519     1.020627     0.998906     0.963615
min      -3.000000    -3.000000    -2.969285    -2.942798
25%      -0.647930    -0.589216    -0.663148    -0.667419
50%       0.015103     0.066755     0.005569    -0.059944
75%       0.710248     0.782405     0.688046     0.612678
max       3.000000     3.000000     3.000000     3.000000

In [74]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0  1.0
1 -1.0  1.0 -1.0  1.0
2  1.0 -1.0  1.0 -1.0
3  1.0  1.0 -1.0 -1.0
4  1.0 -1.0 -1.0 -1.0

In [75]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [76]:
sampler = np.random.permutation(5)#permutation对Series或者DataFrame的行进行随机置换
sampler

array([3, 2, 4, 1, 0])

In [77]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3

In [79]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
2   8   9  10  11
1   4   5   6   7

In [80]:
choice = pd.Series([5, 7, -1, 6, 4])
draws = choice.sample(n=10, replace=True)
draws

4    4
3    6
0    5
4    4
0    5
2   -1
0    5
1    7
1    7
2   -1
dtype: int64

In [82]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [83]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [85]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('C:/Users/32947/Desktop/DataAnalysis/datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames)
movies[:10]

D:\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: read_table is deprecated, use read_csv instead.
  This is separate from the ipykernel package so we can avoid doing imports until
D:\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  This is separate from the ipykernel package so we can avoid doing imports until

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [87]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [89]:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)
gen = movies.genres[0]
gen.split('|')

['Animation', "Children's", 'Comedy']

In [90]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [93]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [94]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [96]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [98]:
val = 'a, b,    guido'
val.split(',')

['a', ' b', '    guido']

In [99]:
pieces = [x.strip() for x in val.split(',')]#strip清除空格
pieces

['a', 'b', 'guido']

In [100]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [101]:
'::'.join(pieces)

'a::b::guido'

In [102]:
'guido' in val

True

In [105]:
val.index(',')

1

In [107]:
val.find(':')

-1

In [108]:
val.index(':')

ValueError: substring not found

In [109]:
val.count(',')

2

In [110]:
val.replace(',', '::')

'a:: b::    guido'

# 正则表达式

In [111]:
import re#正则表达式
text = "foo     bar\t baz  \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [112]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [113]:
regex.findall(text)

['     ', '\t ', '  \t']

In [114]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex = re.compile(pattern, flags=re.IGNORECASE)
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [115]:
m = regex.search(text)
m

In [116]:
text[m.start():m.end()]

'dave@google.com'

In [117]:
print(regex.match(text))

None

In [118]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [119]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [120]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [121]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [122]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [123]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [124]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [125]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [126]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [127]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [128]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [129]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [130]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object